# London Housing Data Analysis

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("house.csv")

In [3]:
df.head()

,date,area,average_price,code,houses_sold,no_of_crimes
0,1/1/1995,city of london,91449,E09000001,17.0,NaN
1,2/1/1995,city of london,82203,E09000001,7.0,NaN
2,3/1/1995,city of london,79121,E09000001,14.0,NaN
3,4/1/1995,city of london,77101,E09000001,7.0,NaN
4,5/1/1995,city of london,84409,E09000001,10.0,NaN

In [4]:
df.tail()

            date     area  average_price       code  houses_sold  no_of_crimes
13544   9/1/2019  england         249942  E92000001      64605.0           NaN
13545  10/1/2019  england         249376  E92000001      68677.0           NaN
13546  11/1/2019  england         248515  E92000001      67814.0           NaN
13547  12/1/2019  england         250410  E92000001          NaN           NaN
13548   1/1/2020  england         247355  E92000001          NaN           NaN

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13549 entries, 0 to 13548
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           13549 non-null  object
 1   area           13549 non-null  object
 2   average_price  13549 non-null  int64
 3   code           13549 non-null  object
 4   houses_sold    13455 non-null  float64
 5   no_of_crimes   7439 non-null   float64
dtypes: float64(2), int64(1), object(3)
memory usage: 635.2+ KB